---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BadNosingProfile
source: html/7da5dc52-f76c-6114-dc18-3ca1206490a0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BadNosingProfile Property

Stairs nosing profile must have one loop. Wrong profile will not be shown in profiles list in Stairs Type properties.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadNosingProfile { get; }
```